// ### Info

// - 임경인
// - 1997/05/07
// - 나의 장점 4가지
//     - 장점은 내가 증명 할 수 있는것들 혹은 부자연스럽지 않은것을 적는것이 중요
//     - 협업 능력
//     - On & Off
//     - 꾸준한 자아성찰


// 1. 협업능력
// => 사람을 좋아하는 성격으로 새로운 사람을 만나고 같이 일을 하는데 두려움과 어려움이 없습니다.
/*
=> 활발하고 편한 분위기를 조성하는 장점을 가졌기 때문에 의견을 말 할수있는 분위기를 잘 만드는 편이고
그런 분위기 위에서 많은 질문과 의견필역을 통해 요구사항을 최대한 명확하게 하려고 하는성격을 가졌다보니
타협에 어려운 부분이나 언쟁이 될 수 있는 부분을 유연하게 대처하는 편입니다.

=> 일전 진행한 Team Project에서는 모든부분에 팀장을 맡았었고 가장 중요하게 생각했던것 두가지는
의견을 주저없이 얘기하고 그 의견들을 냉철한 시선에서 바라보고 수렴하는 분위기를 강조했고,
나머지 하나는 우리 프로젝트에서 정해야하는 사항이 있다면 무조껀 모두의 동의하에 해당 사항을 진행
하고 채택하는것을 중요하게 생각하고 분위기를 조성했습니다.

모두의 동의가 있어야하기 때문에 상대방을 설득하면서 나누는 대화에서 문제점 혹은 제시한것이 좋은 이유에 대해
더 생각해보고 토론을 통해서 우리의 프로젝트에서 꼭 필요한것인지 다시한번 생각하게 되는 상황이 만들어지며
제시자가 생각하지못한 문제점이나 혹은 반대하는 입장도 장점을 다시한번 생각하게 되면서 상호작용으로 더 발전되는 상황이 많이 만들어졌었습니다.

그래서 저는 이러한 경험들과 저의 성향으로 다른 직무와 같이 일하는것에 두려움이나 혹은 어려움이 있지 않고 좋은 협업능력을 가졌습니다.

*/

// 2. on&off
/*
  => 저는 On&Off가 확실합니다.
*/
// 3. 꾸준한 성장욕구
// 4. 본인에게 엄격한 성격

export default function AboutMe() {
  return (
    <div>
      <ul>
        <li>협업능력</li>
        <li>On&Off</li>
        <li>성장 욕구</li>
        <li>본인에게 엄격함</li>
      </ul>
    </div>
  );
}
