// ### Info

// - 임경인
// - 1997/05/07
// - 나의 장점 4가지
//     - 장점은 내가 증명 할 수 있는것들 혹은 부자연스럽지 않은것을 적는것이 중요
//     - 협업 능력
//     - On & Off
//     - 꾸준한 자아성찰 => 다이어트,주말마다 하는거, 야간대학


// 1. 협업능력
// => 사람을 좋아하는 성격으로 새로운 사람을 만나고 같이 일을 하는데 두려움과 어려움이 없습니다.
/*
=> 활발하고 편한 분위기를 조성하는 장점을 가졌기 때문에 의견을 말 할수있는 분위기를 잘 만드는 편이고
그런 분위기 위에서 많은 질문과 의견필역을 통해 요구사항을 최대한 명확하게 하려고 하는성격을 가졌다보니
타협에 어려운 부분이나 언쟁이 될 수 있는 부분을 유연하게 대처하는 편입니다.

=> 일전 진행한 Team Project에서는 모든부분에 팀장을 맡았었고 가장 중요하게 생각했던것 두가지는
의견을 주저없이 얘기하고 그 의견들을 냉철한 시선에서 바라보고 수렴하는 분위기를 강조했고,
나머지 하나는 우리 프로젝트에서 정해야하는 사항이 있다면 무조껀 모두의 동의하에 해당 사항을 진행
하고 채택하는것을 중요하게 생각하고 분위기를 조성했습니다.

모두의 동의가 있어야하기 때문에 상대방을 설득하면서 나누는 대화에서 문제점 혹은 제시한것이 좋은 이유에 대해
더 생각해보고 토론을 통해서 우리의 프로젝트에서 꼭 필요한것인지 다시한번 생각하게 되는 상황이 만들어지며
제시자가 생각하지못한 문제점이나 혹은 반대하는 입장도 장점을 다시한번 생각하게 되면서 상호작용으로 더 발전되는 상황이 많이 만들어졌었습니다.

그래서 저는 이러한 경험들과 저의 성향으로 다른 직무와 같이 일하는것에 두려움이나 혹은 어려움이 있지 않고 좋은 협업능력을 가졌습니다.

*/

// 2. on&off
/*
  => 저는 On&Off가 확실합니다. 일 할때의 자아와 휴식할때의 자아를 가지고 있습니다.
  업무를 하면서 근무에 집중하는것도 중요하지만 그만큼 받은 스트레스와 소진된 채력을 다시 회복하는것도 필요하다고 생각합니다.
  개발처럼 짧은 단거리가 아닌 장거리 마라톤을 달려야하는 직종일수록 휴식을 어떻게 자신에게 맞춰서 효율있게 쉴 수 있는지도
  매우 중요하고 내가 어떤것을 할때 혹은 어디를 갈때 내가 편해지고 휴식을 느끼는지를 찾는 자아성찰을 할 줄 아는 사람이기 떄문에
  공과 사가 잘 구분되고 근무때는 깊은 몰입으로 생산성있는 사람이 되어서 일하고 쉴때는 저에게 맞는 방법으로 휴식을 취함으로
  근무중 받은 스트레스와 소진된 채력을 빠르게 회복하는 사람입니다.

  => 어떻게 쉬는데 ( 회사가 추구하는 컬쳐핏에 따라 얘기할 수 있음 )

  1. 운동
  => 제 취미중 하나는 운동인데 가장 좋아하는 운동은 수영과 헬스 입니다.
  수영은 이전 강사를 할 정도로 많이 좋아하는 스포츠이고 받은 스트레스를 해소할때 수영을 하면
  이전 생각에 대한 정리도 되고 정신이 맑아지는 편이라 수영을 하는 편입니다.

  그리고 헬스는 살이찌면서 둔해지고 정신이 나태해진다고 생각이 들어서 시작했는데 무게를 올리면서 드는
  성취감과 점점 몸이좋아지고 꾸준히 가면서 무엇이든 꾸준히 하게되면 성장하고 해낼 수 있다는걸 알게해준 운동이다보니
  위 운동 둘을 하면서 스트레스를 해소하고 업무에 더 좋은 영향을 줄 수 있는 부분을 얻을 수 있었던것 같습니다.\

    => 그럼 쉬어야 일을 할 수 있는거야? 쉬는중 일을 해야하는 상황이오면? 우린 그럴수있어
    잘 쉬는것도 근무를 위해 필요한것이라고 생각합니다 하지만 잘 쉬는게 절대적으로 오래쉰다의 개념이 아닌
    짧게 쉬더라도 내가 스트레스를 해소하고 짧은시간안에 효율적으로 상황에 맞춘 휴식을 할 수 있다면
    좋다고 생각합니다. 쉬는중 일을 해야하는 상황이 온다면 근무가 우선이기 때문에 일을 하고 그 사이사이
    시간이 나거나 혹은 나지않는다면 이후에 상황에 맞춘 휴식을 진행할것 같습니다.

  2. 친구와 외출
  => 저는 지인과의 외출로 스트레스를 해소하고 

  => 
*/
// 3. 꾸준한 성장욕구
// 4. 본인에게 엄격한 성격

export default function AboutMe() {
  return (
    <div>
      <ul>
        <li>협업능력</li>
        <li>On&Off</li>
        <li>성장 욕구</li>
        <li>본인에게 엄격함</li>
      </ul>
    </div>
  );
}
